{"backgrounds":[],"races":[],"subraces":[],"classes":[{"name":"Artificer","displayname":"Artificer","hitdie":"8","armorproficiencies":["Light Armor","Medium Armor"],"weaponproficiencies":["Simple Weapons"],"toolproficiencies":["Thieves' Tools","One type of artisan's tools","One type of artisan's tools"],"equipment":[{"weapon":{"type":"simple"}},{"weapon":{"type":"simple"}},{"weapon":{"name":"Crossbow, Light"}},"Bolts (20)",{"selection":[{"armor":{"name":"Scale Mail"}},{"armor":{"name":"Studded Leather"}}]},"Thieves' Tools","Dungeoneer's Pack"],"saveproficiencies":["constitution","intelligence"],"classskills":["arcana","deception","history","investigation","medicine","nature","perception","sleight of hand"],"skillcount":"2","spellprogression":"third","spellcastingability":"intelligence","multiclass":{"abilityscoreprerequisites":[{"greaterthanorequal":{"first":"strengthscore","second":"0"}}]},"level":{"1":[{"featuretextwithbullet":"Magical Tinkering: You may imbue a number of Tiny nonmagical objects (up to your Int modifier) as an action with one of the following magical properties. You can end the effect as an action.\n   - The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet\n   - You utter a message (up to 6 seconds long) that can be heard up to 10 feet away whenever the object is tapped by a creature\n   - The object continuously emits your choice of an odor or a nonverbal sound perceivable up to 10 feet away\n   - A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements"},{"featuretextwithbullet":"Spellcasting: You gain the ability to cast spells. Your spell ability modifier is Intelligence. You can use an arcane focus for your Artificer spells."}],"2":[{"featuretextwithbullet":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 3 infusions known, and can infuse up to 2 items during a long rest."},{"sharedclassfeaturemenu":{"name":"Artificer Infusions","selections":"3","class":"Artificer"}}],"3":[{"featuretextwithbullet":"Tool Proficiency: Your proficiency bonus is doubled for any ability check you make with a tool."},{"archetypemenu":""}],"4":[{"replacestringfromfeaturetext":{"replacementtext":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 4 infusions known, and can infuse up to 2 items during a long rest.","find":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 3 infusions known, and can infuse up to 2 items during a long rest."}},{"sharedclassfeaturemenu":{"name":"Artificer Infusions","selections":"1","class":"Artificer"}},{"abilityscoreimprovement":""}],"5":[{"featuretextwithbullet":"Arcane Armament: You can attack twice whenever you take the Attack action on your turn, but one of the attacks must be made with a magic weapon."}],"6":[{"replacestringfromfeaturetext":{"replacementtext":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 4 infusions known, and can infuse up to 3 items during a long rest.","find":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 4 infusions known, and can infuse up to 2 items during a long rest."}}],"7":[{"replacestringfromfeaturetext":{"replacementtext":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 5 infusions known, and can infuse up to 3 items during a long rest.","find":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 4 infusions known, and can infuse up to 3 items during a long rest."}},{"sharedclassfeaturemenu":{"name":"Artificer Infusions","selections":"1","class":"Artificer"}}],"8":[{"abilityscoreimprovement":""}],"10":[{"featuretextwithbullet":"The Right Cantrip for the Job: Whenever you finish a short or long rest, you can replace one of the artificer cantrips you know with another cantrip from the artificer spell list."}],"11":[{"replacestringfromfeaturetext":{"replacementtext":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 6 infusions known, and can infuse up to 4 items during a long rest.","find":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 5 infusions known, and can infuse up to 3 items during a long rest."}}],"12":[{"abilityscoreimprovement":""}],"15":[{"replacestringfromfeaturetext":{"replacementtext":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 7 infusions known, and can infuse up to 4 items during a long rest.","find":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 6 infusions known, and can infuse up to 4 items during a long rest."}}],"16":[{"abilityscoreimprovement":""},{"replacestringfromfeaturetext":{"replacementtext":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 7 infusions known, and can infuse up to 5 items during a long rest.","find":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 7 infusions known, and can infuse up to 4 items during a long rest."}}],"18":[{"featuretextwithbullet":"Spell-Storing Item: After a long rest, you can touch one weapon or spellcasting focus and store a spell in it. It must be a 1st-or 2nd-level artificer spell that requires 1 action to cast. While holding the object, a creature can take an action to produce the spell's effect from it using your spellcasting ability modifier. The spell stays in the object until it has been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again."}],"19":[{"replacestringfromfeaturetext":{"replacementtext":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 8 infusions known, and can infuse up to 5 items during a long rest.","find":"Infuse Item: You gain the ability to imbue mundane items with magical infusions. You currently have 7 infusions known, and can infuse up to 5 items during a long rest."}},{"abilityscoreimprovement":""}],"20":[{"featuretextwithbullet":"Soul of Artifice: You can attune to up to six magic items at once. In addition, you gain a +1 bonus to all saving throws per magic item you are currently attuned to."}]}}],"archetypes":[{"name":"Alchemist","displayname":"Alchemist","class":"Artificer","previewtext":"Expert at combining exotic reagents to produce a variety of materials including potions, alchemist's fire, and other useful items.","level":{"3":[{"featuretextwithbullet":"Tools of the Trade: You gain profiency with alchemist's supplies and the herbalism kit, and aquire them for free. Also, crafting a magic item in the potion category takes a quarter of the normal time and costs half as much of the usual gold."},{"featuretextwithbullet":"Alchemical Homunculus: You learn ancient methods for magically creating a special homunculus that is formed by alchemical substances. See the rulebook for details."},{"addtoolproficiencies":["Alchemist's Supplies","Herbalism Kit"]},{"addspell":{"name":"Purify Food and Drink","spelllevel":"1"}},{"addspell":{"name":"Ray of Sickness","spelllevel":"1"}}],"5":[{"addspell":{"name":"Melf's Acid Arrow","spelllevel":"2"}},{"addspell":{"name":"Web","spelllevel":"2"}}],"6":[{"featuretextwithbullet":"Alchemical Mastery: When you cast a spell using your alchemist's supplies as the spellcasting focus, you gain a bonus to one roll of the spell. That roll must restore hit points or be a damage roll that deals acid or poison damage, and the bonus equals your Intelligence modifier (minimum of +1). In addition, you can cast lesser restoration without expending a spell slot, provided you use alchemist's supplies as the spellcasting focus. You can do so a number of times per day equal to your Intelligence modifier (minimum of once)"},{"addspell":{"name":"Lesser Restoration","spelllevel":"2"}}],"9":[{"addspell":{"name":"Create Food and Water","spelllevel":"3"}},{"addspell":{"name":"Stinking Cloud","spelllevel":"3"}}],"13":[{"addspell":{"name":"Blight","spelllevel":"4"}},{"addspell":{"name":"Death Ward","spelllevel":"4"}}],"14":[{"featuretextwithbullet":"Chemical Savant: You gain resistance to acid damage and poison damage, and you are now immune to the poisoned condition. In addition, you can cast greater restoration once without expending a spell slot and without providing the material component, provided you use alchemist's supplies as the spellcasting focus. You regain the ability to do so when you finish a long rest."}],"17":[{"addspell":{"name":"Cloudkill","spelllevel":"5"}},{"addspell":{"name":"Raise Dead","spelllevel":"5"}}]}}],"sharedclassfeatures":[],"sharedclassfeaturemenus":[{"name":"Alchemical Formula","title":"Alchemical Formula","selections":"1","entries":[{"name":"Boots of the Winding Path","displayname":"Boots of the Winding Path","previewtext":"Teleport to a recently traveled space","prerequisites":[{"greaterthanorequal":{"first":{"classlevel":"Artificer"},"second":"5"}}],"hideifprerequisitesnotmet":"true","effects":[{"featuretextwithbullet":"Boots of the Winding Path (Item: a pair of boots; Requires attunment) - While wearing these boots, a creature can teleport up to 15 feet as a bonus action to an unoccupied space the creature can see. The creature must have occupied that space at some point during the current turn."}]},{"name":"Enhanced Defense","displayname":"Enhanced Defense","previewtext":"Increased AC while wearing the infused item","effects":[{"featuretextwithbullet":"Enhanced Defense (Item: a suit of armor or a shield) - A creature gains a +1 bonus to Armor Class while wearing (armor) or wielding (shield) the infused item. The bonus increases to +2 when you reach 12th level in this class."}]},{"name":"Enhanced Wand","displayname":"Enhanced Wand","previewtext":"+1 bonus to spell attack rolls, and ingore half cover","effects":[{"featuretextwithbullet":"Enhanced Wand (Item: a wand; Requires attunment) - While holding this wand, a creature gains a +1 bonus to spell attack rolls. In addition, the creature ignores half cover when making a spell attack. The bonus increases to +2 when you reach 12th level in this class."}]},{"name":"Enhanced Weapon","displayname":"Enhanced Weapon","previewtext":"+1 bonus to attack and damage rolls","effects":[{"featuretextwithbullet":"Enhanced Weapon (Item: a simple or martial weapon) - This magic weapon grants a +1 bonus to attack and damage rolls made with it. The bonus increases to +2 when you reach 12th level in this class."}]},{"name":"Many-Handed Pouch","displayname":"Many-Handed Pouch","previewtext":"Pouches that share an interdimensional space","prerequisites":[{"greaterthanorequal":{"first":{"classlevel":"Artificer"},"second":"4"}}],"hideifprerequisitesnotmet":"true","effects":[{"featuretextwithbullet":"Many-Handed Pouch (Item: 2-5 pouches) - The infused pouches all share one interdimensional space of the same capacity as a single pouch. Thus, reaching into any of the pouches allows access to the same storage space. A pouch operates as long as it is within 100 miles of another one of the pouches; the pouch is otherwise empty and won't accept any contents. If this infusion ends, the items stored in the shared space move into one of the pouches, determined at random. The rest of the pouches become empty."}]},{"name":"Radiant Weapon","displayname":"Radiant Weapon","previewtext":"A magical weapon imbued with radiant energy","prerequisites":[{"greaterthanorequal":{"first":{"classlevel":"Artificer"},"second":"8"}}],"hideifprerequisitesnotmet":"true","effects":[{"featuretextwithbullet":"Radiant Weapon (Item: weapon; Requires attunment) - Grants a +1 bonus to attack and damage rolls made with this weapon. As a bonus action, the wielder can cause it to shed bright light in a 30ft radius and dim light for an additional 30ft, and can extinguish it as a bonus action. Once per rest as a reaction immediately after being hit by a melee attack, the wielder can cause the attacker to be blinded until the end of the attacker's next turn, unless the attacker succeeds on a Constitution saving throw against your spell save DC."}]},{"name":"Replicate Magic Item","displayname":"Replicate Magic Item","previewtext":"Replicate a specific magic item","effects":[{"featuretextwithbullet":"Replicate Magic Item (Item: varies; May require attunment) - When you learn this infusion, choose a magic item from the Replicable Magic Items table. You gain the ability to infuse a  mundane item to become your chosen magical item."}]},{"name":"Repulsion Shield","displayname":"Repulsion Shield","previewtext":"A magical shield that can push away attackers","prerequisites":[{"greaterthanorequal":{"first":{"classlevel":"Artificer"},"second":"8"}}],"hideifprerequisitesnotmet":"true","effects":[{"featuretextwithbullet":"Repulsion Shield (Item: a shield; Requires attunment) - A creature gains a +1 bonus to AC while wielding this shield. Once per rest after being hit by a melee attack, the weilder can use a reaction to push the attacker up to 15ft away."}]},{"name":"Resistant Armor","displayname":"Resistant Armor","previewtext":"A suit of armor that is resistant to a specific damage  type","prerequisites":[{"greaterthanorequal":{"first":{"classlevel":"Artificer"},"second":"8"}}],"hideifprerequisitesnotmet":"true","effects":[{"featuretextwithbullet":"Resistant Armor (Item: a suite of armor; Requires attunment) - While wearing this armor, a creature has resistance to one of the following damage types, which you choose when you infuse the item: acid, cold, fire, force, lightning, necrotic, poison, psychic, radiant, or thunder."}]},{"name":"Returning Weapon","displayname":"Returning Weapon","previewtext":"A weapon that returns when thrown","effects":[{"featuretextwithbullet":"Returning Weapon Item (Item: a weapon with the thrown property) - This magic weapon grants a +1 bonus to attack and damage rolls made with it, and it returns to the wielder's hand immediately after it is used to make a ranged attack."}]}]}],"feats":[],"weapons":[]}
